# DESARROLLO DE LA PRUEBA

# Librerias

In [11]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

## 1. Lectura de los datos

In [2]:
data= pd.read_csv("Cruceros.csv")

## 2. Mostrar columnas

In [3]:
data.head()

,Ship_name,Cruise_line,Age,Tonnage,passengers,length,cabins,passenger_density,crew
0,Journey,Azamara,6,30.277,6.94,5.94,3.55,42.64,3.55
1,Quest,Azamara,6,30.277,6.94,5.94,3.55,42.64,3.55
2,Celebration,Carnival,26,47.262,14.86,7.22,7.43,31.80,6.70
3,Conquest,Carnival,11,110.000,29.74,9.53,14.88,36.99,19.10
4,Destiny,Carnival,17,101.353,26.42,8.92,13.21,38.36,10.00

## 3. Calcular estadísticas básicas de los datos, interpretarlos y enunciar sus observaciones

In [4]:
# tipos de variables

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 158 entries, 0 to 157
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Ship_name          158 non-null    object
 1   Cruise_line        158 non-null    object
 2   Age                158 non-null    int64
 3   Tonnage            158 non-null    float64
 4   passengers         158 non-null    float64
 5   length             158 non-null    float64
 6   cabins             158 non-null    float64
 7   passenger_density  158 non-null    float64
 8   crew               158 non-null    float64
dtypes: float64(6), int64(1), object(2)
memory usage: 11.2+ KB

In [6]:
#cantidad de datos
len_data=len(data)
print("Cantidad de observaciones: ",len(data))

Cantidad de observaciones:  158

In [7]:
#Valores unicos
s=[print("La variable " + name + " tiene como valores unicos: \n"+ ", ".join(map(str,data[name].unique())),"\n") 
for name in list(data.select_dtypes(include='object').columns)]

La variable Ship_name tiene como valores unicos:
Journey, Quest, Celebration, Conquest, Destiny, Ecstasy, Elation, Fantasy, Fascination, Freedom, Glory, Holiday, Imagination, Inspiration, Legend, Liberty*, Miracle, Paradise, Pride, Sensation, Spirit, Triumph, Valor, Victory, Century, Constellation, Galaxy, Infinity, Mercury, Millenium, Solstice, Summit, Xpedition, Zenith, Allegra, Atlantica, Classica, Europa, Fortuna, Magica, Marina, Mediterranea, Romantica, Serena, Victoria, Serenity, Symphony, QueenElizabethII, QueenMary2, QueenVictoria, Magic, Wonder, Amsterdam, Eurodam, Maasdam, Noordam, Oosterdam, Prinsendam, Rotterdam, Ryndam, Statendam, Veendam, Volendam, Westerdam, Zaandam, Zuiderdam, Armonia, Fantasia, Lirica, Melody, Musica, Opera, Rhapsody, Sinfonia, Crown, Dawn, Dream, Gem, Jewel, Majesty, PrideofAloha, PrideofAmerica, Sea, Star, Sun, Wind, Insignia, Nautica, Regatta, MarcoPolo, Arcadia, Artemis, Aurora, Oceana, Oriana, Ventura, Caribbean, Coral, Diamond, Emerald, Golden, Grand, Island, Pacific, Regal, Royal, Saphire, Tahitian, ExplorerII, Mariner, Navigator, PaulGauguin, Voyager, Adventure, Brilliance, Empress, Enchantment, Explorer, Grandeur, Independence, Liberty, Monarch, Oasis, Radiance, Serenade, Sovreign, Splendour, Vision, Cloud, Shadow, Whisper, Aries, Gemini, Libra, Pisces, Taurus, Virgo, Surf

La variable Cruise_line tiene como valores unicos:
Azamara, Carnival, Celebrity, Costa, Crystal, Cunard, Disney, Holland_American, MSC, Norwegian, Oceania, Orient, P&O, Princess, Regent_Seven_Seas, Royal_Caribbean, Seabourn, Silversea, Star, Windstar

In [8]:
# Variables categoricas
data.describe(include=[object])

       Ship_name      Cruise_line
count        158              158
unique       138               20
top       Spirit  Royal_Caribbean
freq           4               23

In [9]:
# Variables numericas
data.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Age,158.0,15.689873,7.615691,4.000,10.0000,14.000,20.0000,48.00
Tonnage,158.0,71.284671,37.229540,2.329,46.0130,71.899,90.7725,220.00
passengers,158.0,18.457405,9.677095,0.660,12.5350,19.500,24.8450,54.00
length,158.0,8.130633,1.793474,2.790,7.1000,8.555,9.5100,11.82
cabins,158.0,8.830000,4.471417,0.330,6.1325,9.570,10.8850,27.00
passenger_density,158.0,39.900949,8.639217,17.700,34.5700,39.085,44.1850,71.43
crew,158.0,7.794177,3.503487,0.590,5.4800,8.150,9.9900,21.00

In [ ]:
# variables discretas
plt.figure(figsize=(22,30))
vars_to_plot = data.select_dtypes(include=['object']).columns.tolist()
for i, var in enumerate(vars_to_plot):
    plt.subplot(12,4,i+1)
    sns.boxplot(x = var, y='edad_', data = data)
    title_string = "Boxplot of edad vs. " + var
    plt.ylabel("Edad")
    plt.title(title_string)